app/Controllers/CadastrarUsuarios.php

INSERT INTO `usuarios` (`Usuario`, `login`, `senha`) VALUES ('bos', 'mosqueiro[[', '333')
---
    public function cadastrar()
    {


        print_r($_POST);

        $usuario = $_POST['nome_usuario'];
        $login = $_POST['login'];
        $senha = $_POST['senha'];


        $db = \config\Database::connect();

        $data = [
            'Usuario' => $usuario,
            'login' => $login,
            'senha' => $senha,

        ];

        $db->table('usuarios')->insert($data); //qualquer coisa grita que eu volto.b3z