app/Controllers/EditarPaciente.php

DELETE FROM `pacientes`
WHERE `Id_Paciente` = '9'
---
    public function excluir($id)
    {
        $db = \config\Database::connect();

        try {
            $db->table('pacientes')->where('Id_Paciente', $id)->delete(); //qualquer coisa grita que eu volto.b3z