app/Controllers/EditarProfissional.php

            'Complemento' => $complemento,
            'Telefone' => $telefone,
        ];
        $db->table('profissional')->where('Id_Profissional', $id)->update($data);
---
UPDATE `profissional` SET `Nome_Profissional` = 'Cleumbergue Guedes Gomes', `Formacao` = 'QuiroPraxista', `CPF` = '83764923', `Data_Nascimento` = '1993-10-15', `Sexo` = 'M', `Cep` = '78980665', `Logradouro` = 'rua pimenta', `Bairro` = 'magaleta', `Cidade` = 'Porto Velho', `UF` = 'RO', `Numero` = '6554', `Complemento` = 'SC', `Telefone` = '69987650986'
WHERE `Id_Profissional` = '1'