app/Controllers/PesquisarPacientes.php

    public function index()
    {
        $db = \config\Database::connect();

        //$query = $db->query("SELECT Id_Paciente, Nome_Paciente, CPF, Telefone FROM pacientes");
        //$resultado = $query->getResult();
        $pacientesModel = new PacientesModel();
        $resultado = $pacientesModel->select('Id_Paciente, Nome_Paciente, CPF, Telefone')->findAll();
---
SELECT `Id_Paciente`, `Nome_Paciente`, `CPF`, `Telefone`
FROM `pacientes`