app/Controllers/PesquisarProfissionais.php

    public function index()
    {
        //$db = \config\Database::connect();

        //$query = $db->query("SELECT Nome_Profissional, CPF, Telefone, Sexo FROM profissional");
        //$resultado = $query->getResult();
        $profissionalModel = new ProfissionaisModel();
        $resultado = $profissionalModel->select('Id_Profissional, Nome_Profissional, CPF, Telefone,Sexo')->findAll();
---
SELECT `Id_Profissional`, `Nome_Profissional`, `CPF`, `Telefone`, `Sexo`
FROM `profissional`